package by.epam.module04.simple_class.task9;

/*
 * Создать класс Book, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и
 * метод toString(). Создать второй класс, агрегирующий массив типа Book, с подходящими конструкторами и
 * методами. Задать критерии выбора данных и вывести эти данные на консоль.
 */

public class Main {

	public static void main(String[] args) {

		final int databaseSize = 10;

		Book[] books = new Book[databaseSize];
		
		books[0] = new Book("Мастер и Маргарита", "Михаил Булгаков", "Эксмо", 2017, 416, 9.01, "Мягкая обложка");
		books[1] = new Book("Волшебник Изумрудного города", "Александр Волков", "Machaon", 2017, 224, 6.77, "Твердый переплет");
		books[2] = new Book("Морфий. Записки юного врача", "Михаил Булгаков", "Эксмо", 2019, 416, 8.01, "Мягкая обложка");
		books[3] = new Book("Братья Карамазовы", "Федор Достоевский", "АСТ", 2019, 784, 9.35, "Твердый переплет");
		books[4] = new Book("Повесть о настоящем человеке", "Борис Полевой", "Эксмо", 2017, 352, 9.29, "Мягкая обложка");
		books[5] = new Book("Преступление и наказание", "Федор Достоевский", "Эксмо", 2019, 592, 8.14, "Твердый переплет");
		books[6] = new Book("Герой нашего времени", "Михаил Лермонтов", "Азбука", 2014, 256, 6.76, "Мягкая обложка");
		books[7] = new Book("Анна Каренина", "Лев Толстой", "Эксмо", 2019, 800, 9.37, "Твердый переплет");
		books[8] = new Book("Отцы и дети", "Иван Тургенев", "Азбука", 2018, 192, 6.70, "Твердый переплет");
		books[9] = new Book("Война и мир", "Лев толстой", "Азбука", 2014, 1408, 16.38, "Твердый переплет");
		
		BookLogic.viewBooksBySelectedAuthor(books);

		BookLogic.viewBooksBySelectedPublisher(books);

		BookLogic.viewBooksAfterTheSelectedYear(books);

	}

}
